# Taps
tap "homebrew/bundle"

# Formulae (CLI tools)
brew "git"
brew "gh"
brew "composer"
brew "bun"
brew "nvm"
brew "yarn"
brew "mas"
brew "mackup"

# Casks (GUI apps)
cask "warp"
cask "arc"
cask "google-chrome"
cask "zed"
cask "setapp"
cask "github"
cask "spotify"
cask "herd"
cask "upscayl"
cask "slack"
cask "betterdisplay"
cask "imageoptim"
cask "ray"
cask "tinkerwell"
cask "microsoft-office"

# QuickLook plugins
cask "qlmarkdown"
cask "quicklook-json"
